labyWeir_share/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    allBoundary
    {
        type            noSlip;
    }
    inlet
    {
        type            variableHeightFlowRateInletVelocity;
        flowRate        table;
        flowRateCoeffs
        {
            values          
3
(
(0 0)
(5 200)
(10 200)
(20 0)
)
;
        }
        alpha           alpha.water;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    bed
    {
        type            noSlip;
    }
    weir
    {
        type            noSlip;
    }
    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
