labyWeir_share/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pressure; //calls pressure from #include initialConditions & stores in var internalField

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient; //free flowing pressure outlet
    }

    bed
    {
        type            fixedFluxPressure;
    }
    weir
    {
        type            fixedFluxPressure;
    }

    top
    {
        type            totalPressure;
        p0              uniform 0;
    }
    
    allBoundary
    {
        type            fixedFluxPressure;
    }

}

// ************************************************************************* //
