labyWeir_share/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volVectorFieldValue U (0 0 0)
);

regions
(
   surfaceToCell
    {
        file "iniVol.stl";
        outsidePoints ((10 0 1)); // definition of outside
        includeCut true; // cells cut by surface
        includeInside yes; // cells not on outside of surf
        includeOutside no; // cells on outside of surf
        nearDistance -0.1; // cells with centre near surf
        curvature 0.9; // cells within nearDistance

        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volVectorFieldValue U (0 0 0)
        ); 
    }

   
   
   
    boxToCell
    {
        box (-1 -11 -1) (0 11 5);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
   
);


// ************************************************************************* //
